GOAP-Dev01/_example-sdk_2024123-ZGM230SA_/_EXAMPLE-SDK_2024123-ZGM230SA_/src/DevCommandClasses/Configuration/src/CC_Configuration.c
 /***************************************************************************//**
 * @file CC_Configuration.c
 * @brief CC_Configuration.c
 * @copyright 2020 Silicon Laboratories Inc.
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/
// -----------------------------------------------------------------------------
//                   Includes
// -----------------------------------------------------------------------------
#include <string.h>
#include <stddef.h>
#include <stdbool.h>
#include <assert.h>
#include <CC_Configuration.h>
#include <ZW_TransportEndpoint.h>
#include <ZAF_Common_interface.h>
#include <stddef.h>
#include <cc_configuration_config_api.h>
#include <cc_configuration_io.h>
#include "zaf_transport_tx.h"
#include "CfgParsIF.h"
#include "em_msc.h"

//#define DEBUGPRINT
#include "DebugPrint.h"

// -----------------------------------------------------------------------------
//                Macros and Typedefs
// -----------------------------------------------------------------------------
#define SLI_CC_CONFIGURATION_MAX_STR_LENGTH (256)
#define DEFAULT_FLAG (0x80)
#define HANDSHAKE_FLAG (0x40)
// -----------------------------------------------------------------------------
//              Static Function Declarations
// -----------------------------------------------------------------------------

/**
 * Handler for Configuration CC set command
 * @param[in] pRxOpt Receive options.
 * @param[in] pCmd Payload including command class.
 * @param[in] cmdLength Length of the received command.
 * @return Result of command parsing.
*/
static received_frame_status_t
cc_configuration_command_set(  RECEIVE_OPTIONS_TYPE_EX const * pRxOpt,
                                  ZW_APPLICATION_TX_BUFFER const * pCmd,
                                  const uint8_t cmdLength);

/**
 * Handler for Configuration CC get command
 * @param[in] pRxOpt Receive options.
 * @param[in] pCmd Payload including command class.
 * @param[in] cmdLength Length of the received command.
 * @return Result of command parsing.
*/
static received_frame_status_t
cc_configuration_command_get(  RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                  ZW_APPLICATION_TX_BUFFER const * pCmd,
                                  const uint8_t cmdLength);

/**
 * Handler for Configuration CC get info command
 * @param[in] pRxOpt Receive options.
 * @param[in] pCmd Payload including command class.
 * @param[in] cmdLength Length of the received command.
 * @return Result of command parsing.
*/
static received_frame_status_t
cc_configuration_command_info( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                  ZW_APPLICATION_TX_BUFFER const * pCmd,
                                  const uint8_t cmdLength);

/**
 * Handler for Configuration CC get name command
 * @param[in] pRxOpt Receive options.
 * @param[in] pCmd Payload including command class.
 * @param[in] cmdLength Length of the received command.
 * @return Result of command parsing.
*/
static received_frame_status_t
cc_configuration_command_name_get( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                      ZW_APPLICATION_TX_BUFFER const * pCmd,
                                      const uint8_t cmdLength);

/**
 * Handler for Configuration CC get property
 * @param[in] pRxOpt Receive options.
 * @param[in] pCmd Payload including command class.
 * @param[in] cmdLength Length of the received command.
 * @return Result of command parsing.
*/
static received_frame_status_t
cc_configuration_command_properties_get( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                            ZW_APPLICATION_TX_BUFFER const * pCmd,
                                            const uint8_t cmdLength);

/**
 * Handler for Configuration CC get bulk
 * @param[in] pRxOpt Receive options.
 * @param[in] pCmd Payload including command class.
 * @param[in] cmdLength Length of the received command.
 * @return Result of command parsing.
*/
static received_frame_status_t
cc_configuration_command_bulk_get( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                      ZW_APPLICATION_TX_BUFFER const * pCmd,
                                      const uint8_t cmdLength);

/**
 * Handler for Configuration CC set bulk
 * @param[in] pRxOpt Receive options.
 * @param[in] pCmd Payload including command class.
 * @param[in] cmdLength Length of the received command.
 * @return Result of command parsing.
*/
static received_frame_status_t
cc_configuration_command_bulk_set( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                      ZW_APPLICATION_TX_BUFFER const * pCmd,
                                      const uint8_t cmdLength);

/**
 * Handler for sending bulk report response
 * @param[in] pRxOpt Receive options.
 * @param[in] parameter_offset offset from the first parameter's number
 * @param[in] stop number where the bulk report should end
 * @param[in] flag_handshake if true the function call is a result of handshake request
 * @return Result of command parsing.
*/
static received_frame_status_t
cc_configuration_command_send_bulk_report( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                              const uint16_t parameter_offset,
                                              const uint16_t stop_number,
                                              const bool flag_handshake);

/**
 * Handler for resetting to the default state
 * @param[in] pRxOpt Receive options.
 * @param[in] pCmd Payload including command class.
 * @param[in] cmdLength Length of the received command.
 * @return Result of command parsing.
*/
static received_frame_status_t
cc_configuration_command_default_reset( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                           ZW_APPLICATION_TX_BUFFER const * pCmd,
                                           const uint8_t cmdLength);

/**
 * Copy value to raw frame
 * @param[out] pFrame the raw frame where the data will be copied to
 * @param[in] parameter_buffer reference to the parameter
 * @param[in] pField which will be copied from
 * @return Result of the conversion which is a recevived_frame_status_t type
*/
static void
cc_configuration_copyToFrame(  cc_config_parameter_value_t* pFrame,
                                  const cc_config_parameter_buffer_t* parameter_buffer,
                                  const cc_config_parameter_value_t* pField);

/**
 * Resets a configuration value back to default value
 * @param[in] parameter_number configuration's number to reset
 * @return Result of the reset true in case of success, else false
*/
static bool
cc_configuration_reset_to_default_value(uint16_t parameter_number);

/**
 * Sets a configuration's value to a new one
 * @param[in] parameter_number configuration's number to change
 * @param[in] new_value pointer to a new configuration value
 * @param[in] size size of the new configuration value
 * @return Result of the setting, NOT_SUPPORTED, FAIL, or OK
*/
static cc_config_configuration_set_return_value
cc_configuration_set(uint16_t parameter_number,
                        cc_config_parameter_value_t* new_value,
                        cc_config_parameter_size_t size);

/**
 * Checks if a parameter is between the min and max values, it not it minimize or maximize.
 * This function is for signed integers
 * @param[in] parameter_buffer configuration's parameter which has the limits
 * @param[out] pNewValue the new value to be limited
 * @return Result of the limiting true in case of success, else false
*/
static bool
cc_configuration_limit_value_signed_int(cc_config_parameter_buffer_t const* parameter_buffer,
                                           cc_config_parameter_value_t * pNewValue);

/**
 * Checks if a parameter is between the min and max values, it not it minimize or maximize.
 * This function is for signed integers
 * @param[in] parameter_buffer configuration's parameter which has the limits
 * @param[out] pNewValue the new value to be limited
 * @return Result of the limiting true in case of success, else false
*/
static bool
cc_configuration_limit_value_signed_int_8bit(cc_config_parameter_buffer_t const * parameter_buffer,
                                                 cc_config_parameter_value_t * pNewValue);

/**
 * Checks if a parameter is between the min and max values, it not it minimize or maximize.
 * This function is for signed integers
 * @param[in] parameter_buffer configuration's parameter which has the limits
 * @param[out] pNewValue the new value to be limited
 * @return Result of the limiting true in case of success, else false
*/
static bool
cc_configuration_limit_value_signed_int_16bit(cc_config_parameter_buffer_t const * parameter_buffer,
                                                 cc_config_parameter_value_t * pNewValue);

/**
 * Checks if a parameter is between the min and max values, it not it minimize or maximize.
 * This function is for signed integers
 * @param[in] parameter_buffer configuration's parameter which has the limits
 * @param[out] pNewValue the new value to be limited
 * @return Result of the limiting true in case of success, else false
*/
static bool
cc_configuration_limit_value_signed_int_32bit(cc_config_parameter_buffer_t const * parameter_buffer,
                                                 cc_config_parameter_value_t * pNewValue);

/**
 * Checks if a parameter is between the min and max values, it not it minimize or maximize.
 * This function is for unsigned integers
 * @param[in] parameter_buffer configuration's parameter which has the limits
 * @param[out] pNewValue the new value to be limited
 * @return Result of the limiting true in case of success, else false
*/
static bool
cc_configuration_limit_value_unsigned_int(cc_config_parameter_buffer_t const* parameter_buffer,
                                             cc_config_parameter_value_t * pNewValue);

/**
 * Checks if a parameter is between the min and max values, it not it minimize or maximize.
 * This function is for unsigned integers
 * @param[in] parameter_buffer configuration's parameter which has the limits
 * @param[out] pNewValue the new value to be limited
 * @return Result of the limiting true in case of success, else false
*/
static bool
cc_configuration_limit_value_unsigned_int_8bit(cc_config_parameter_buffer_t const* parameter_buffer,
                                                   cc_config_parameter_value_t * pNewValue);

/**
 * Checks if a parameter is between the min and max values, it not it minimize or maximize.
 * This function is for unsigned integers
 * @param[in] parameter_buffer configuration's parameter which has the limits
 * @param[out] pNewValue the new value to be limited
 * @return Result of the limiting true in case of success, else false
*/
static bool
cc_configuration_limit_value_unsigned_int_16bit(cc_config_parameter_buffer_t const* parameter_buffer,
                                                   cc_config_parameter_value_t * pNewValue);

/**
 * Checks if a parameter is between the min and max values, it not it minimize or maximize.
 * This function is for unsigned integers
 * @param[in] parameter_buffer configuration's parameter which has the limits
 * @param[out] pNewValue the new value to be limited
 * @return Result of the limiting true in case of success, else false
*/
static bool
cc_configuration_limit_value_unsigned_int_32bit(cc_config_parameter_buffer_t const* parameter_buffer,
                                                   cc_config_parameter_value_t * pNewValue);
/**
 * Finds the configuration with the lowest number in the pool
 * @param[out] parameter_buffer a pointer to a cc_config_parameter_t pointer to pass back the reference of the first configuration
 * @return Result of the look up true in case of success, else false
*/
static bool
cc_configuration_get_first_parameter(cc_config_parameter_buffer_t* parameter_buffer);


/**
 * Calculates how many more frames are needed to send the whole dara
 * @param[in] data_length  length of the data to be sent
 * @param[in] payload_limit maximum payload length
 * @return number of maximum reports to follow
*/
static uint8_t
cc_configuration_calc_reports_to_follow(size_t data_length, size_t payload_limit);

/**
 * Determine the first parameter number
 *
 * @param[out] parameter_buffer pointer to a parameter buffer which will holds the metadata and current value of a parameter
 * @return same type as cc_configuration_get
 */
static bool
cc_configuration_probe(cc_config_parameter_buffer_t* parameter_buffer);

/**
 * Find the next valid parameter number in case of an invalid  one
 * @param[in] input holds the value of the current (invalid) parameter number
 * @return the next available parameter number, if not exist, the fist available parameter number is given back
 */
static uint16_t
cc_configuration_find_next_valid_parameter_number(uint16_t input);

/**
 * Give back the first available parameter number
 * @return the fist available parameter number is given back
 */
static uint16_t
cc_configuration_get_lowest_parameter_number();

/**
 * Check if the given parameter number is valid
 * @param[in] input holds the value of the current tested parameter number
 * @return true if the parameter number is valid, false anyway
 */
static bool
cc_configuration_check_if_parameter_number_is_valid(uint16_t input);

/**
 * Check, whether the size parameter is valid or not
 * @param[in] size_value the size value that needs to be checked
 * @return true if valid, false anyways
*/
static bool
cc_configuration_is_valid_size(cc_config_parameter_size_t size_value);

