GOAP-Dev01/_example-sdk_2024123-ZGM230SA_/_EXAMPLE-SDK_2024123-ZGM230SA_/src/DevCommandClasses/Configuration/src/CC_Configuration.c
static size_t
cc_configuration_strnlen(const char *str, size_t maxlen);
// -----------------------------------------------------------------------------
//                Global Variables
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
//                Static Variables
// -----------------------------------------------------------------------------
/**< cc_configuration_t pointer to the meta data of the parameters */
static cc_configuration_t const* configuration_pool;
// -----------------------------------------------------------------------------
//              Public Function Definitions
// -----------------------------------------------------------------------------
static void
init_and_reset(void)
{
  bool retval = false;
  bool is_migrated = false;
  cc_config_parameter_buffer_t parameter_buffer = { 0 };
  configuration_pool = cc_configuration_get_configuration();

  for(uint16_t loop_cnt = 0; loop_cnt < configuration_pool->numberOfParameters ; loop_cnt++)
  {
    is_migrated = false;

    parameter_buffer.metadata = &configuration_pool->parameters[loop_cnt];

    retval = cc_configuration_io_read( parameter_buffer.metadata->file_id,
                                        (uint8_t*)&parameter_buffer.data_buffer,
                                          sizeof(cc_config_parameter_value_t));

    if(retval == false)
    {
      /*Parameter is not stored, let's write it*/
      retval = cc_configuration_io_write( parameter_buffer.metadata->file_id,
                                            (const uint8_t*)&configuration_pool->parameters[loop_cnt].attributes.default_value,
                                            sizeof(cc_config_parameter_value_t));
    }
    else if(configuration_pool->parameters[loop_cnt].migration_handler != NULL)
    {
      is_migrated = configuration_pool->parameters[loop_cnt].migration_handler(&parameter_buffer);
    }

    if(is_migrated == true)
    {
      /*Parameter is not stored, let's write it*/
      retval = cc_configuration_io_write( parameter_buffer.metadata->file_id,
                                            (const uint8_t*)&parameter_buffer.data_buffer,
                                            sizeof(cc_config_parameter_value_t));
    }
  }

  assert(retval == true);
}

static void
cc_configuration_copyToFrame(  cc_config_parameter_value_t* pFrame,
                                  const cc_config_parameter_buffer_t* parameter_buffer,
                                  const cc_config_parameter_value_t* pField)
{
  if( (pFrame != NULL)           &&
      (parameter_buffer != NULL) &&
      (pField != NULL))
  {

    if(NULL != parameter_buffer->metadata)
    {
      int8_t src_ix  = (int8_t)parameter_buffer->metadata->attributes.size - 1;
      int8_t dest_ix = 0;

      while((src_ix >= 0) && (dest_ix < (int8_t)sizeof(pFrame->as_uint8_array)))
      {
        pFrame->as_uint8_array[dest_ix] = pField->as_uint8_array[src_ix];
        src_ix--;
        dest_ix++;
      }
    }
  }
}

static received_frame_status_t CC_Configuration_handler(RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                                        ZW_APPLICATION_TX_BUFFER *pCmd,
                                                        uint8_t cmdLength,
                                                        __attribute__((unused)) ZW_APPLICATION_TX_BUFFER * pFrameOut,
                                                        __attribute__((unused)) uint8_t * pLengthOut)
{
  received_frame_status_t frame_status = RECEIVED_FRAME_STATUS_NO_SUPPORT;

  switch (pCmd->ZW_Common.cmd) {
    case CONFIGURATION_INFO_GET_V4:
      frame_status = cc_configuration_command_info(pRxOpt, pCmd, cmdLength);
      break;
    case CONFIGURATION_GET_V4:
      frame_status = cc_configuration_command_get(pRxOpt, pCmd, cmdLength);
      break;
    case CONFIGURATION_SET_V4:
      frame_status = cc_configuration_command_set(pRxOpt, pCmd, cmdLength);
      break;
    case CONFIGURATION_NAME_GET_V4:
      frame_status = cc_configuration_command_name_get(pRxOpt, pCmd, cmdLength);
      break;
    case CONFIGURATION_PROPERTIES_GET_V4:
      frame_status = cc_configuration_command_properties_get(pRxOpt, pCmd, cmdLength);
      break;
    case CONFIGURATION_BULK_GET_V4:
      frame_status = cc_configuration_command_bulk_get(pRxOpt, pCmd, cmdLength);
      break;
    case CONFIGURATION_BULK_SET_V4:
      frame_status = cc_configuration_command_bulk_set(pRxOpt, pCmd, cmdLength);
      break;
    case CONFIGURATION_DEFAULT_RESET_V4:
      frame_status = cc_configuration_command_default_reset(pRxOpt, pCmd, cmdLength);
      break;
    default:
      break;
  }
  return frame_status;
}

// -----------------------------------------------------------------------------
//              Static Function Definitions
// -----------------------------------------------------------------------------
static bool
cc_configuration_limit_value_signed_int_8bit(cc_config_parameter_buffer_t const * parameter_buffer,
                                                cc_config_parameter_value_t * pNewValue)
{
  bool return_value = true;

  if( parameter_buffer->metadata->attributes.min_value.as_int8 > pNewValue->as_int8)
  {
    pNewValue->as_int8 = parameter_buffer->metadata->attributes.min_value.as_int8;
    return_value = false;
  }
  else if( parameter_buffer->metadata->attributes.max_value.as_int8 < pNewValue->as_int8)
  {
    pNewValue->as_int8 = parameter_buffer->metadata->attributes.max_value.as_int8;
    return_value = false;
  }

  return return_value;
}

static bool
cc_configuration_limit_value_signed_int_16bit(cc_config_parameter_buffer_t const * parameter_buffer,
                                                 cc_config_parameter_value_t * pNewValue)
{
  bool return_value = true;

  if( parameter_buffer->metadata->attributes.min_value.as_int16 > pNewValue->as_int16)
  {
    pNewValue->as_int16 = parameter_buffer->metadata->attributes.min_value.as_int16;
    return_value = false;
  }
  else if( parameter_buffer->metadata->attributes.max_value.as_int16 < pNewValue->as_int16)
  {
    pNewValue->as_int16 = parameter_buffer->metadata->attributes.max_value.as_int16;
    return_value = false;
  }

  return return_value;
}

static bool
cc_configuration_limit_value_signed_int_32bit(cc_config_parameter_buffer_t const * parameter_buffer,
                                                 cc_config_parameter_value_t * pNewValue)
{
  bool return_value = true;

  if( parameter_buffer->metadata->attributes.min_value.as_int32 > pNewValue->as_int32)
  {
    pNewValue->as_int32 = parameter_buffer->metadata->attributes.min_value.as_int32;
    return_value = false;
  }
  else if( parameter_buffer->metadata->attributes.max_value.as_int32 < pNewValue->as_int32)
  {
    pNewValue->as_int32 = parameter_buffer->metadata->attributes.max_value.as_int32;
    return_value = false;
  }

  return return_value;
}

static bool
cc_configuration_limit_value_signed_int(cc_config_parameter_buffer_t const * parameter_buffer,
                                           cc_config_parameter_value_t * pNewValue)
{
  bool return_value = true;

  switch(parameter_buffer->metadata->attributes.size)
  {
    case CC_CONFIG_PARAMETER_SIZE_8_BIT:
      return_value = cc_configuration_limit_value_signed_int_8bit(parameter_buffer, pNewValue);
      break;
    case CC_CONFIG_PARAMETER_SIZE_16_BIT:
      return_value = cc_configuration_limit_value_signed_int_16bit(parameter_buffer, pNewValue);
      break;
    case CC_CONFIG_PARAMETER_SIZE_32_BIT:
      return_value = cc_configuration_limit_value_signed_int_32bit(parameter_buffer, pNewValue);
      break;
    default:
      break;
  }

  return return_value;
}

static bool
cc_configuration_limit_value_unsigned_int_8bit(cc_config_parameter_buffer_t const* parameter_buffer,
                                             cc_config_parameter_value_t * pNewValue)
{
  bool return_value = true;

  if( parameter_buffer->metadata->attributes.min_value.as_uint8 > pNewValue->as_uint8)
  {
    pNewValue->as_uint8 = parameter_buffer->metadata->attributes.min_value.as_uint8;
    return_value = false;
  }
  else if( parameter_buffer->metadata->attributes.max_value.as_uint8 < pNewValue->as_uint8)
  {
    pNewValue->as_uint8 = parameter_buffer->metadata->attributes.max_value.as_uint8;
    return_value = false;
  }

  return return_value;
}

static bool
cc_configuration_limit_value_unsigned_int_16bit(cc_config_parameter_buffer_t const* parameter_buffer,
                                                   cc_config_parameter_value_t * pNewValue)
{
  bool return_value = true;

  if( parameter_buffer->metadata->attributes.min_value.as_uint16 > pNewValue->as_uint16)
  {
    pNewValue->as_uint16 = parameter_buffer->metadata->attributes.min_value.as_uint16;
    return_value = false;
  }
  else if( parameter_buffer->metadata->attributes.max_value.as_uint16 < pNewValue->as_uint16)
  {
    pNewValue->as_uint16 = parameter_buffer->metadata->attributes.max_value.as_uint16;
    return_value = false;
  }

  return return_value;
}

static bool
cc_configuration_limit_value_unsigned_int_32bit(cc_config_parameter_buffer_t const* parameter_buffer,
                                                   cc_config_parameter_value_t * pNewValue)
{
  bool return_value = true;

