GOAP-Dev01/_example-sdk_2024123-ZGM230SA_/_EXAMPLE-SDK_2024123-ZGM230SA_/src/DevCommandClasses/Configuration/src/CC_Configuration.c
  if( parameter_buffer->metadata->attributes.min_value.as_uint32 > pNewValue->as_uint32)
  {
    pNewValue->as_uint32 = parameter_buffer->metadata->attributes.min_value.as_uint32;
    return_value = false;
  }
  else if( parameter_buffer->metadata->attributes.max_value.as_uint32 < pNewValue->as_uint32)
  {
    pNewValue->as_uint32 = parameter_buffer->metadata->attributes.max_value.as_uint32;
    return_value = false;
  }

  return return_value;
}

static bool
cc_configuration_limit_value_unsigned_int(cc_config_parameter_buffer_t const* parameter_buffer,
                                             cc_config_parameter_value_t * pNewValue)
{
  bool return_value = true;

  switch(parameter_buffer->metadata->attributes.size)
  {
    case CC_CONFIG_PARAMETER_SIZE_8_BIT:
      return_value = cc_configuration_limit_value_unsigned_int_8bit(parameter_buffer, pNewValue);
      break;
    case CC_CONFIG_PARAMETER_SIZE_16_BIT:
      return_value = cc_configuration_limit_value_unsigned_int_16bit(parameter_buffer, pNewValue);
      break;
    case CC_CONFIG_PARAMETER_SIZE_32_BIT:
      return_value = cc_configuration_limit_value_unsigned_int_32bit(parameter_buffer, pNewValue);
      break;
    default:
      break;
  }

  return return_value;
}

bool
cc_configuration_limit_value(cc_config_parameter_buffer_t const* parameter_buffer,
                                cc_config_parameter_value_t * pNewValue)
{
  bool return_value = true;

  switch (parameter_buffer->metadata->attributes.format)
  {
    case CC_CONFIG_PARAMETER_FORMAT_SIGNED_INTEGER:
      return_value = cc_configuration_limit_value_signed_int(parameter_buffer, pNewValue);
      break;
    case CC_CONFIG_PARAMETER_FORMAT_UNSIGNED_INTEGER:
      return_value = cc_configuration_limit_value_unsigned_int(parameter_buffer, pNewValue);
      break;
    default:
      break;
  }

  return return_value;
}

static received_frame_status_t
cc_configuration_command_info(   RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                    const ZW_APPLICATION_TX_BUFFER *pCmd,
                                    __attribute__((unused)) const uint8_t cmdLength)
{
  ZW_CONFIGURATION_PROPERTIES_GET_V4_FRAME const* pCfgNameGetFrame = &pCmd->ZW_ConfigurationPropertiesGetV4Frame;

  cc_config_parameter_buffer_t parameter_buffer = { 0 };
  const uint16_t payload_limit = ZAF_getAppHandle()->pNetworkInfo->MaxPayloadSize;
  uint16_t parameter_number = (uint16_t)(((uint16_t)pCfgNameGetFrame->parameterNumber1<<8) | pCfgNameGetFrame->parameterNumber2);

  zaf_tx_options_t tx_options = { 0 };
  bool is_io_transaction_success = false;
  uint8_t reports_to_follow_count = 0;

  if (true == Check_not_legal_response_job(pRxOpt))
  {
    return RECEIVED_FRAME_STATUS_FAIL;
  }

  is_io_transaction_success = cc_configuration_get(parameter_number, &parameter_buffer);
  ZW_APPLICATION_TX_BUFFER txBuf = {
    .ZW_ConfigurationInfoReport4byteV4Frame.cmdClass   = COMMAND_CLASS_CONFIGURATION_V4,
    .ZW_ConfigurationInfoReport4byteV4Frame.cmd        = CONFIGURATION_INFO_REPORT_V4,
    .ZW_ConfigurationInfoReport4byteV4Frame.parameterNumber1 = pCfgNameGetFrame->parameterNumber1,
    .ZW_ConfigurationInfoReport4byteV4Frame.parameterNumber2 = pCfgNameGetFrame->parameterNumber2,
    .ZW_ConfigurationInfoReport4byteV4Frame.reportsToFollow  = reports_to_follow_count
  };
  zaf_transport_rx_to_tx_options(pRxOpt, &tx_options);

  if(is_io_transaction_success != false)
  {
    size_t str_pointer = 0;
    size_t info_str_length = cc_configuration_strnlen(parameter_buffer.metadata->attributes.info,
                                                  SLI_CC_CONFIGURATION_MAX_STR_LENGTH);
    size_t info1_offset_in_struct = offsetof(ZW_CONFIGURATION_INFO_REPORT_4BYTE_V4_FRAME , info1);
    // maximum supported length of an info field per frame
    uint16_t info_field_limit = payload_limit - info1_offset_in_struct;
    reports_to_follow_count = cc_configuration_calc_reports_to_follow(info_str_length, info_field_limit);
    txBuf.ZW_ConfigurationInfoReport4byteV4Frame.reportsToFollow  = reports_to_follow_count;

    while(str_pointer < info_str_length)
    {
      size_t remaining_byte_count = info_str_length - str_pointer;
      size_t byte_count_to_send   = (remaining_byte_count >= info_field_limit) ? info_field_limit : remaining_byte_count;
      size_t frame_size_bytes     = info1_offset_in_struct /*header size*/
                                    + byte_count_to_send;

      uint8_t* raw_buffer = (uint8_t*)&txBuf;
      memcpy((void*)&raw_buffer[info1_offset_in_struct],
             (const void*)&parameter_buffer.metadata->attributes.info[str_pointer],
             byte_count_to_send);

      if(!zaf_transport_tx((uint8_t*) &txBuf, frame_size_bytes, NULL, &tx_options)) {
        return RECEIVED_FRAME_STATUS_FAIL;
      }

      str_pointer+=byte_count_to_send;
      txBuf.ZW_ConfigurationInfoReport4byteV4Frame.reportsToFollow--;
    }
  }
  else
  {
    if(!zaf_transport_tx((uint8_t*) &txBuf, sizeof(txBuf.ZW_ConfigurationInfoReport4byteV4Frame), NULL, &tx_options)) {
      return RECEIVED_FRAME_STATUS_FAIL;
    }
  }

  return RECEIVED_FRAME_STATUS_SUCCESS;
}

static received_frame_status_t
cc_configuration_command_name_get( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                      const ZW_APPLICATION_TX_BUFFER *pCmd,
                                      __attribute__((unused)) const uint8_t cmdLength)
{
  ZW_CONFIGURATION_NAME_GET_V4_FRAME const* pCfgNameGetFrame = &pCmd->ZW_ConfigurationNameGetV4Frame;

  const uint16_t payload_limit = ZAF_getAppHandle()->pNetworkInfo->MaxPayloadSize;
  uint16_t parameter_number = (uint16_t)(((uint16_t)pCfgNameGetFrame->parameterNumber1<<8) | pCfgNameGetFrame->parameterNumber2);
  cc_config_parameter_buffer_t parameter_buffer = { 0 };

  zaf_tx_options_t tx_options = { 0 };
  bool is_io_transaction_success = false;
  uint8_t reports_to_follow_count = 0;
  size_t name_str_length = 0;

  if (true == Check_not_legal_response_job(pRxOpt))
  {
    return RECEIVED_FRAME_STATUS_FAIL;
  }

  is_io_transaction_success = cc_configuration_get(parameter_number, &parameter_buffer);
  ZW_APPLICATION_TX_BUFFER txBuf = {
    .ZW_ConfigurationNameReport4byteV4Frame.cmdClass = COMMAND_CLASS_CONFIGURATION_V4,
    .ZW_ConfigurationNameReport4byteV4Frame.cmd      = CONFIGURATION_NAME_REPORT_V4,
    .ZW_ConfigurationNameReport4byteV4Frame.parameterNumber1 = pCfgNameGetFrame->parameterNumber1,
    .ZW_ConfigurationNameReport4byteV4Frame.parameterNumber2 = pCfgNameGetFrame->parameterNumber2,
    .ZW_ConfigurationNameReport4byteV4Frame.reportsToFollow  = reports_to_follow_count
  };
  zaf_transport_rx_to_tx_options(pRxOpt, &tx_options);

  if(is_io_transaction_success != false)
  {
    size_t str_pointer = 0;
    size_t name1_offset_in_struct = offsetof(ZW_CONFIGURATION_NAME_REPORT_4BYTE_V4_FRAME , name1);

    name_str_length = cc_configuration_strnlen(parameter_buffer.metadata->attributes.name,
                                                   SLI_CC_CONFIGURATION_MAX_STR_LENGTH);

    reports_to_follow_count = cc_configuration_calc_reports_to_follow(name_str_length, payload_limit);
    txBuf.ZW_ConfigurationNameReport4byteV4Frame.reportsToFollow  = reports_to_follow_count;

    while(str_pointer < name_str_length)
    {
      size_t remaining_byte_count = name_str_length - str_pointer;
      size_t byte_count_to_send   = (remaining_byte_count >= payload_limit) ? payload_limit : remaining_byte_count;
      size_t frame_size_bytes     = name1_offset_in_struct /*header size*/
                                    + byte_count_to_send;

      uint8_t* raw_buffer = (uint8_t*)&txBuf;
      memcpy((void*)&raw_buffer[name1_offset_in_struct],
            (const void*)&parameter_buffer.metadata->attributes.name[str_pointer],
            byte_count_to_send);

      if(!zaf_transport_tx((uint8_t*) &txBuf, frame_size_bytes, NULL, &tx_options)) {
        return RECEIVED_FRAME_STATUS_FAIL;
      }

