GOAP-Dev01/_example-sdk_2024123-ZGM230SA_/_EXAMPLE-SDK_2024123-ZGM230SA_/src/DevCommandClasses/Configuration/src/CC_Configuration.c
      str_pointer+=byte_count_to_send;
      txBuf.ZW_ConfigurationInfoReport4byteV4Frame.reportsToFollow--;
    }
  }
  else
  {
    if(!zaf_transport_tx((uint8_t*) &txBuf, sizeof(txBuf.ZW_ConfigurationInfoReport4byteV4Frame), NULL, &tx_options)) {
      return RECEIVED_FRAME_STATUS_FAIL;
    }

  }

  return RECEIVED_FRAME_STATUS_SUCCESS;
}

static received_frame_status_t
cc_configuration_command_set(   __attribute__((unused)) RECEIVE_OPTIONS_TYPE_EX const *rxOpt,
                                ZW_APPLICATION_TX_BUFFER const *pCmd,
                                __attribute__((unused)) const uint8_t cmdLength)
{
  received_frame_status_t frame_status = RECEIVED_FRAME_STATUS_SUCCESS;
  ZW_CONFIGURATION_SET_4BYTE_V4_FRAME const* pCfgSetFrame = &pCmd->ZW_ConfigurationSet4byteV4Frame;
  cc_config_parameter_size_t size  =   pCfgSetFrame->level&0x07;

  if((false == cc_configuration_is_valid_size(size)))
  {
    return RECEIVED_FRAME_STATUS_FAIL;
  }

  bool is_default                  = ((pCfgSetFrame->level&0x80) == 0x80)?true:false;


  if(is_default == false)
  {
    cc_config_parameter_value_t new_value = { 0 };
    const cc_config_parameter_value_t* pConfigValue = ( cc_config_parameter_value_t *)&pCmd->ZW_ConfigurationSet4byteV4Frame.configurationValue1;
    uint8_t size_of_configuration_values = (uint8_t)size;

    for(uint8_t index = 0; index < size_of_configuration_values; index++)
    {
      new_value.as_uint8_array[size_of_configuration_values - index - 1] = pConfigValue->as_uint8_array[index];
    }

    cc_config_configuration_set_return_value return_value = cc_configuration_set(pCfgSetFrame->parameterNumber, &new_value, size);
    if(( CC_CONFIG_RETURN_CODE_IO_FAIL == return_value) || (CC_CONFIG_RETURN_CODE_NOT_SUPPORTED == return_value))
    {
      frame_status = RECEIVED_FRAME_STATUS_FAIL;
    }
  }
  else
  {
    if(false == cc_configuration_reset_to_default_value(pCfgSetFrame->parameterNumber))
    {
      frame_status = RECEIVED_FRAME_STATUS_FAIL;
    }
  }

  return frame_status;
}

static received_frame_status_t
cc_configuration_command_get( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                              ZW_APPLICATION_TX_BUFFER const * pCmd,
                              __attribute__((unused)) const uint8_t cmdLength)
{
  ZW_CONFIGURATION_GET_V4_FRAME const* pCfgGetFrame = &pCmd->ZW_ConfigurationGetV4Frame;
  ZW_APPLICATION_TX_BUFFER txBuf;
  uint16_t parameter_number = pCfgGetFrame->parameterNumber;
  cc_config_parameter_buffer_t parameter_buffer;
  bool is_io_transaction_success = false;
  zaf_tx_options_t tx_options;

  memset(&txBuf, 0, sizeof(ZW_APPLICATION_TX_BUFFER));

  if (true == Check_not_legal_response_job(pRxOpt))
  {
    return RECEIVED_FRAME_STATUS_FAIL;
  }

  is_io_transaction_success = cc_configuration_get(parameter_number, &parameter_buffer);

  // Sonarcube error suppress (Dereference of undefined pointer value)
  if(NULL != parameter_buffer.metadata)
  {
    parameter_number = parameter_buffer.metadata->number;
  }


  if(is_io_transaction_success == false)
  {
    /*Unknown parameter number, get the first one*/
    is_io_transaction_success = cc_configuration_get_first_parameter(&parameter_buffer);
  }

  txBuf.ZW_ConfigurationReport4byteV4Frame.cmdClass        = COMMAND_CLASS_CONFIGURATION_V4;
  txBuf.ZW_ConfigurationReport4byteV4Frame.cmd             = CONFIGURATION_REPORT_V4;
  txBuf.ZW_ConfigurationReport4byteV4Frame.parameterNumber = (uint8_t)parameter_number;
  if(NULL != parameter_buffer.metadata)
  {
    txBuf.ZW_ConfigurationReport4byteV4Frame.level         = (uint8_t)parameter_buffer.metadata->attributes.size;
  }

  cc_configuration_copyToFrame((cc_config_parameter_value_t *)&txBuf.ZW_ConfigurationReport4byteV4Frame.configurationValue1,
                                  &parameter_buffer,
                                  &parameter_buffer.data_buffer);

  zaf_transport_rx_to_tx_options(pRxOpt, &tx_options);

  if(!zaf_transport_tx((uint8_t*) &txBuf, sizeof(txBuf.ZW_ConfigurationReport4byteV4Frame), NULL, &tx_options)) {
    return RECEIVED_FRAME_STATUS_FAIL;
  }

  return RECEIVED_FRAME_STATUS_SUCCESS;
}


static uint16_t
cc_configuration_find_next_valid_parameter_number(uint16_t input)
{
  uint16_t global_difference = 0xFF;
  uint16_t next_number = 0;
  const uint16_t lowest_number = cc_configuration_get_lowest_parameter_number();

  for(uint8_t i = 0; i < configuration_pool->numberOfParameters; i++)
  {
    if((configuration_pool->parameters[i].next_number - input) <= global_difference)
    {
      global_difference = configuration_pool->parameters[i].next_number - input;
      next_number = configuration_pool->parameters[i].next_number;
    }
  }
  // return the calculated next number
  return ((next_number == 0) ? lowest_number : next_number);
}

static bool
cc_configuration_check_if_parameter_number_is_valid(uint16_t input)
{
  bool result = false;

  for(uint8_t i = 0; i < configuration_pool->numberOfParameters; i++)
  {
    if(input == configuration_pool->parameters[i].number)
    {
      result = true;
      break;
    }
  }
  return result;
}


static received_frame_status_t
cc_configuration_command_properties_get(RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                        ZW_APPLICATION_TX_BUFFER const * pCmd,
                                        __attribute__((unused)) const uint8_t cmdLength)
{
  ZW_CONFIGURATION_PROPERTIES_GET_V4_FRAME const* pCfgNameGetFrame = &pCmd->ZW_ConfigurationPropertiesGetV4Frame;
  uint16_t parameter_number = (uint16_t)(((uint16_t)pCfgNameGetFrame->parameterNumber1<<8) | pCfgNameGetFrame->parameterNumber2);
  cc_config_parameter_buffer_t parameter_buffer;
  ZW_APPLICATION_TX_BUFFER txBuf;
  zaf_tx_options_t tx_options;
  bool is_valid_parameter_number = cc_configuration_check_if_parameter_number_is_valid(parameter_number);
  if (true == Check_not_legal_response_job(pRxOpt))
  {
    return RECEIVED_FRAME_STATUS_FAIL;
  }

  if(0 == parameter_number)
  {
    cc_configuration_probe(&parameter_buffer);
  }
  else if(true == is_valid_parameter_number)
  {
    cc_configuration_get(parameter_number, &parameter_buffer);
  }

