GOAP-Dev01/_example-sdk_2024123-ZGM230SA_/_EXAMPLE-SDK_2024123-ZGM230SA_/src/DevCommandClasses/Configuration/src/CC_Configuration.c
  zaf_transport_rx_to_tx_options(pRxOpt, &tx_options);

  if( false == is_valid_parameter_number)
  {
    uint8_t* raw_buffer = (uint8_t*)&txBuf;
    uint8_t raw_buffer_index = 0;

    uint16_t next_parameter_number = cc_configuration_find_next_valid_parameter_number(parameter_number);

    raw_buffer[raw_buffer_index++] = COMMAND_CLASS_CONFIGURATION_V4;
    raw_buffer[raw_buffer_index++] = CONFIGURATION_PROPERTIES_REPORT_V4;
    raw_buffer[raw_buffer_index++] = pCfgNameGetFrame->parameterNumber1;
    raw_buffer[raw_buffer_index++] = pCfgNameGetFrame->parameterNumber2;
    raw_buffer[raw_buffer_index++] = 0; // size and format bits are 0 if the parameter number is invalid
    raw_buffer[raw_buffer_index++] = (uint8_t)((next_parameter_number >> 8) & 0xFF);
    raw_buffer[raw_buffer_index++] = (uint8_t)(next_parameter_number  & 0xFF);
    raw_buffer[raw_buffer_index++] = 0; // Properties 2

    if(!zaf_transport_tx((uint8_t*) &txBuf, raw_buffer_index, NULL, &tx_options)) {
      return RECEIVED_FRAME_STATUS_FAIL;
    }
  }
  else
  {
    typedef struct
    {
      uint8_t command_class;
      uint8_t command;
      uint8_t parameter_number_msb;
      uint8_t parameter_number_lsb;

      uint8_t size : 3;
      uint8_t format : 3;
      uint8_t read_only : 1;
      uint8_t altering_capabilities : 1;

      uint8_t variable_info[12 + 2 + 1]; // Min, max & default (1,2,4 bytes), next param & flags
    }
    frame_t;
    frame_t * p_frame = (frame_t *)&txBuf;
    p_frame->command_class          = COMMAND_CLASS_CONFIGURATION_V4;
    p_frame->command                = CONFIGURATION_PROPERTIES_REPORT_V4;
    p_frame->parameter_number_msb   = pCfgNameGetFrame->parameterNumber1;
    p_frame->parameter_number_lsb   = pCfgNameGetFrame->parameterNumber2;
    p_frame->altering_capabilities  = parameter_buffer.metadata->attributes.flags.altering_capabilities;
    p_frame->read_only              = parameter_buffer.metadata->attributes.flags.read_only;
    p_frame->format                 = parameter_buffer.metadata->attributes.format;
    p_frame->size                   = parameter_buffer.metadata->attributes.size;

    uint8_t i = 0;
    cc_configuration_copyToFrame((cc_config_parameter_value_t *)&p_frame->variable_info[i],
                                 &parameter_buffer,
                                 &parameter_buffer.metadata->attributes.min_value);
    i += parameter_buffer.metadata->attributes.size;

    cc_configuration_copyToFrame((cc_config_parameter_value_t *)&p_frame->variable_info[i],
                                 &parameter_buffer,
                                 &parameter_buffer.metadata->attributes.max_value);
    i += parameter_buffer.metadata->attributes.size;

    cc_configuration_copyToFrame((cc_config_parameter_value_t *)&p_frame->variable_info[i],
                                 &parameter_buffer,
                                 &parameter_buffer.metadata->attributes.default_value);
    i += parameter_buffer.metadata->attributes.size;

    // Set next parameter number
    p_frame->variable_info[i++] = (uint8_t)(parameter_buffer.metadata->next_number >> 8);
    p_frame->variable_info[i++] = (uint8_t)(parameter_buffer.metadata->next_number);

    // Hardcode "No Bulk Support" to 0 and add "Advanced" flag.
    p_frame->variable_info[i++] = parameter_buffer.metadata->attributes.flags.advanced & 0x01;

    if(!zaf_transport_tx((uint8_t*) p_frame, offsetof(ZW_CONFIGURATION_PROPERTIES_REPORT_4BYTE_V4_FRAME , minValue1) + i, NULL, &tx_options)) {
      return RECEIVED_FRAME_STATUS_FAIL;
    }
  }

  return RECEIVED_FRAME_STATUS_SUCCESS;
}


static received_frame_status_t
cc_configuration_command_bulk_get(RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                  ZW_APPLICATION_TX_BUFFER const * pCmd,
                                  __attribute__((unused)) const uint8_t cmdLength)
{
  ZW_CONFIGURATION_BULK_GET_V4_FRAME const* pCfgBulkGetFrame = &pCmd->ZW_ConfigurationBulkGetV4Frame;

  uint16_t parameter_offset    = (uint16_t)(((uint16_t)pCfgBulkGetFrame->parameterOffset1<<8) |
                                                       pCfgBulkGetFrame->parameterOffset2);
  uint8_t number_of_parameters = pCfgBulkGetFrame->numberOfParameters;

  if (true == Check_not_legal_response_job(pRxOpt))
  {
    return RECEIVED_FRAME_STATUS_FAIL;
  }

  /*
   * Invoke cc_configuration_command_send_bulk_report() with CC_CONFIG_PARAMETER_SIZE_NOT_SPECIFIED
   * as the Configuration Bulk Get doesn't contain a size.
   */
  return cc_configuration_command_send_bulk_report(pRxOpt,
                                                      parameter_offset,
                                                      parameter_offset + number_of_parameters,
                                                      false);
}

static received_frame_status_t
cc_configuration_command_bulk_set(RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                  ZW_APPLICATION_TX_BUFFER const * pCmd,
                                  __attribute__((unused)) const uint8_t cmdLength)
{
  received_frame_status_t frame_status = RECEIVED_FRAME_STATUS_SUCCESS;
  uint8_t const* p_raw_cmd = (uint8_t const*)pCmd;
  bool io_transaction_result = false;
  cc_config_parameter_buffer_t parameter_buffer;

  uint8_t cmd_index = 0;
  cmd_index++; /*Command Class*/
  cmd_index++; /*Command */

  /*combine parameter offset 1 and 2*/
  uint16_t parameter_offset = (uint16_t)(((uint16_t)p_raw_cmd[cmd_index]<<8) | p_raw_cmd[cmd_index + 1] );
  cmd_index+=2;
  uint8_t number_of_parameters = p_raw_cmd[cmd_index];   /*Number of parameters*/
  cmd_index++;

  bool is_default   = ((p_raw_cmd[cmd_index]&(1<<7)) == 0x80)?true:false; /*Default*/
  bool handshake    = ((p_raw_cmd[cmd_index]&(1<<6)) == 0x40)?true:false; /*Handshake*/
  cc_config_parameter_size_t size = p_raw_cmd[cmd_index]&0x07; /*Size*/
  if(false == cc_configuration_is_valid_size(size))
  {
    return RECEIVED_FRAME_STATUS_FAIL;
  }
  cmd_index++;

  cc_config_parameter_value_t new_parameter_value;
  uint16_t updated_parameter_counter = 0;
  uint16_t parameter_number = parameter_offset;

  uint8_t size_of_new_parameter_value = sizeof(new_parameter_value.as_int32); //sets the default size to 4 bytes
  switch(size)
  {

    case CC_CONFIG_PARAMETER_SIZE_8_BIT:
    size_of_new_parameter_value = sizeof(new_parameter_value.as_int8); //1bytes
    break;

    case CC_CONFIG_PARAMETER_SIZE_16_BIT:
    size_of_new_parameter_value = sizeof(new_parameter_value.as_int16); //2bytes
    break;
    
