GOAP-Dev01/_example-sdk_2024123-ZGM230SA_/_EXAMPLE-SDK_2024123-ZGM230SA_/src/DevCommandClasses/Configuration/src/CC_Configuration.c
    case CC_CONFIG_PARAMETER_SIZE_32_BIT:
    size_of_new_parameter_value = sizeof(new_parameter_value.as_int32); //4bytes
    break;

    default:
    break;
  }

  bool at_least_one_success = false;

  while(updated_parameter_counter < number_of_parameters)
  {
    io_transaction_result = cc_configuration_get(parameter_number, &parameter_buffer);

    if(io_transaction_result == false)
    {
      updated_parameter_counter++;
      continue; 
      // don't attempt to set non-existent parameters, but account for them as part of the "number_of_parameters" function argument
    }

    if(is_default == true)
    {
      cc_configuration_reset_to_default_value(parameter_number);
      at_least_one_success = true;
    }
    else
    {
      memset(&new_parameter_value, 0, sizeof(cc_config_parameter_value_t));

      for(uint8_t index = 0; index < size_of_new_parameter_value ; index++)
      {
        new_parameter_value.as_uint8_array[size_of_new_parameter_value - index -1] = p_raw_cmd[cmd_index + index];
      }

      cc_config_configuration_set_return_value return_value = cc_configuration_set(parameter_number, &new_parameter_value, size);
      if(( CC_CONFIG_RETURN_CODE_IO_FAIL == return_value) || (CC_CONFIG_RETURN_CODE_NOT_SUPPORTED == return_value))
      {
        frame_status = RECEIVED_FRAME_STATUS_FAIL;
        break;
      }
      else if ( CC_CONFIG_RETURN_CODE_OK == return_value)
      {
        at_least_one_success = true;
      }
      cmd_index += size;
    }

    parameter_number++;
    updated_parameter_counter++;
  }

  if(handshake == true)
  {
    frame_status = cc_configuration_command_send_bulk_report(pRxOpt,
                                                                parameter_offset,
                                                                parameter_offset + number_of_parameters,
                                                                handshake);
  }
  if (true != at_least_one_success)
  {
    frame_status = RECEIVED_FRAME_STATUS_FAIL;
  }
  return frame_status;
}

static received_frame_status_t
cc_configuration_command_send_bulk_report( RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                              const uint16_t parameter_offset,
                                              const uint16_t stop_number,
                                              const bool flag_handshake)
{
  bool enqueue_status = false;

  zaf_tx_options_t tx_options;
  zaf_transport_rx_to_tx_options(pRxOpt, &tx_options);

  bool status = true;
  cc_config_parameter_buffer_t parameter_buffer;
  status = cc_configuration_get_first_parameter(&parameter_buffer);
  uint16_t first_parameter_number = 0;

  /*
   * Create the first part of the report.
   */
  ZW_APPLICATION_TX_BUFFER frame;
  uint8_t * p_frame = (uint8_t *)&frame;
  *(p_frame + 0) = COMMAND_CLASS_CONFIGURATION_V4;
  *(p_frame + 1) = CONFIGURATION_BULK_REPORT_V4;
  *(p_frame + 2) = (uint8_t)(parameter_offset >> 8);
  *(p_frame + 3) = (uint8_t)parameter_offset;
  *(p_frame + 4) = 0; // Number of parameters will be filled out later.
  *(p_frame + 5) = 0; // Reports to follow will be filled out later.

  // Set default flag initially. Will be cleared later, if required.
  *(p_frame + 6) = DEFAULT_FLAG;

  if (true == flag_handshake) {
    *(p_frame + 6) |= HANDSHAKE_FLAG;
  }

  uint32_t count = 0;
  cc_config_parameter_size_t parameter_size = 0;
  cc_config_parameter_size_t first_parameter_size = CC_CONFIG_PARAMETER_SIZE_NOT_SPECIFIED;

  // Calculate parameter number for the first parameter to report.
  uint16_t parameter_number = parameter_offset + first_parameter_number;

  /*
   * Calculate the number of consecutive parameters to be reported.
   *
   * The loop breaks on a change in size as the reported parameters must have the same size.
   *
   * This number is required to calculate the total number of reports.
   */
  uint16_t requested_parameter_count = stop_number - parameter_offset;
  for (; count < requested_parameter_count; count++)
  {
    // Get the parameter
    status = cc_configuration_get(parameter_number, &parameter_buffer);

    if (true != status)
    {
      if (0 == parameter_size) // since it is initialized as zero, when this is not true, it was changed
      {
        first_parameter_size = CC_CONFIG_PARAMETER_SIZE_8_BIT;
        // There is no point to search for more than the specified offset, if not found in that range overwrite parameter size
        for (uint8_t Counter = parameter_number; Counter < (parameter_number + requested_parameter_count); Counter++)
        {
          // Since this loop only manages size, it doesn't matter if the data is deposited into the already present parameter_buffer
          // it will get rewriten when the next loop instance is called
          bool tempStatus = cc_configuration_get(Counter, &parameter_buffer);
          if (true == tempStatus) // We found the first valid parameter to extract its size value for all the nonexistent parameters
          {
            first_parameter_size = parameter_buffer.metadata->attributes.size;
            break;
          }
          else if ((Counter + 1) >= (parameter_number + requested_parameter_count)) // && false == tempStatus
          {
            // We didn't find a sinlge valid parameter instance in the parameter offset range, overwrite with the 1st parameter size
            cc_configuration_get(first_parameter_number, &parameter_buffer);
            first_parameter_size = parameter_buffer.metadata->attributes.size;
          }
        }
      }
      parameter_size = first_parameter_size;
    }
    else
    {
      parameter_size = parameter_buffer.metadata->attributes.size;
      first_parameter_size = parameter_size;
    }

    if (parameter_size != first_parameter_size)
    {
      // Only parameters of the same size are allowed in a bulk report. Hence, break on different size.
      break;
    }

    parameter_number++;
  }

  // Set the size
  *(p_frame + 6) |= ((uint8_t)parameter_size & 0x07);

  // Calculate parameter number for the first parameter to report.
  parameter_number = parameter_offset + first_parameter_number;

  const uint8_t REPORT_BASE_LENGTH = 7; // Report contains 7 bytes without any parameters.

