GOAP-Dev01/_example-sdk_2024123-ZGM230SA_/_EXAMPLE-SDK_2024123-ZGM230SA_/src/DevCommandClasses/Configuration/src/CC_Configuration.c
  uint8_t generated_report_length = REPORT_BASE_LENGTH; // Initial length of report.

  // Increase p_frame_parameter by initial report size so it's ready for the first parameter.
  uint8_t * p_frame_parameter = p_frame + generated_report_length;

  uint16_t offset_to_report = parameter_offset;

  /*
   * Calculate the remaining number of reports.
   *
   * This number is used as an initial value to report the number of remaining (following) reports.
   */
  uint8_t remaining_number_of_reports  = 0;
  uint8_t required_payload_size = count * parameter_buffer.metadata->attributes.size;
  const uint16_t payload_limit = ZAF_getAppHandle()->pNetworkInfo->MaxPayloadSize;
  uint8_t available_payload = payload_limit - 7;
  if (available_payload < required_payload_size) {
    remaining_number_of_reports = required_payload_size / available_payload;
    if (required_payload_size % available_payload) {
      remaining_number_of_reports++;
    }
  }

  uint8_t parameter_count_to_report = 0;

  for (uint32_t i = 0; i < count; i++)
  {
    parameter_count_to_report++;

    // Get the parameter
    status = cc_configuration_get(parameter_number, &parameter_buffer);

    if (false != status) {
      // TODO: Handle this case.
    }
    else
    {
      // Initialize metadata structure
      cc_config_parameter_metadata_t metadata_default = {
        .number = parameter_number,
        .attributes = {
          .name = "Empty Parameter",
          .info = "Empty Parameter",
          .min_value = {0},
          .max_value = {0},
          .size = parameter_size,
          .format = CC_CONFIG_PARAMETER_FORMAT_UNSIGNED_INTEGER,
          .default_value = {0},
          .flags = {
            .altering_capabilities = 0,
            .read_only = 0,
            .advanced = 0
          },
        },
        .migration_handler = NULL // If you don't have a migration handler function
      };

      // Initialize buffer structure
      cc_config_parameter_buffer_t parameter_default = {
        .metadata = &metadata_default,
        .data_buffer = {0},
      };
      parameter_buffer = parameter_default;
    }

    /*
     * CC:0070.02.09.11.007: Set the default flag to 1 unless one or more of the parameters are
     * set to a non-default value.
     */
    if (parameter_buffer.data_buffer.as_uint32 != parameter_buffer.metadata->attributes.default_value.as_uint32) {
      *(p_frame + 6) &= ~DEFAULT_FLAG; // Clear default flag.
    }

    generated_report_length += parameter_buffer.metadata->attributes.size;

    cc_configuration_copyToFrame(  (cc_config_parameter_value_t *)p_frame_parameter,
                                      &parameter_buffer,
                                      &parameter_buffer.data_buffer);

    if ((generated_report_length + parameter_buffer.metadata->attributes.size > payload_limit) ||
        ((i + 1) == requested_parameter_count)) {
      // No room for the next parameter or we reach the total number of parameters => Transmit now.

      *(p_frame + 2) = (uint8_t)(offset_to_report >> 8);
      *(p_frame + 3) = (uint8_t)offset_to_report;

      *(p_frame + 4) = parameter_count_to_report; // Number of parameters.

      if (remaining_number_of_reports) {
        remaining_number_of_reports--;
      }
      *(p_frame + 5) = remaining_number_of_reports; // Reports to follow

      enqueue_status = zaf_transport_tx((uint8_t*) p_frame, generated_report_length,
                                        NULL, &tx_options);

      generated_report_length = REPORT_BASE_LENGTH; // Reset generated report length to initial value.
      p_frame_parameter = p_frame + generated_report_length; // Reset pointer to first parameter in report.
      offset_to_report += i + 1; // Increase offset by the number of parameters included in this report.
      parameter_count_to_report = 0;
      *(p_frame + 6) |= DEFAULT_FLAG; // Reset default flag to initial value.
    } else {
      // Increase frame pointer for next parameter
      p_frame_parameter += parameter_buffer.metadata->attributes.size;
    }
    parameter_number++;
  }

  return enqueue_status ? RECEIVED_FRAME_STATUS_SUCCESS : RECEIVED_FRAME_STATUS_FAIL;
}

static received_frame_status_t
cc_configuration_command_default_reset( __attribute__((unused)) RECEIVE_OPTIONS_TYPE_EX *pRxOpt,
                                        __attribute__((unused)) ZW_APPLICATION_TX_BUFFER const * pCmd,
                                        __attribute__((unused)) const uint8_t cmdLength)
{
  bool write_success = false;

  for(uint16_t parameter_ix = 0 ; parameter_ix < configuration_pool->numberOfParameters ; parameter_ix++)
  {
    write_success = cc_configuration_io_write( configuration_pool->parameters[parameter_ix].file_id,
                                                        (const uint8_t*)&configuration_pool->parameters[parameter_ix].attributes.default_value,
                                                          sizeof(cc_config_parameter_value_t));
    if(false == write_success)
    {
      return RECEIVED_FRAME_STATUS_FAIL;
    }

  }
  return RECEIVED_FRAME_STATUS_SUCCESS;
}

static bool cc_configuration_write_serial(uint8_t number, uint32_t value)
{
  uint32_t temp[3];

  uint32_t *addr = (uint32_t *)0x0FE00000;

  memcpy(temp, addr, 3*sizeof(uint32_t));

  memcpy((temp + number), &value, sizeof(uint32_t));

  MSC_Init();

  if(mscReturnOk != MSC_ErasePage(addr))
  {
    return false;
  }

  if(mscReturnOk != MSC_WriteWord(addr, temp,  3*sizeof(uint32_t)))
  {
    return false;
  }

  MSC_Deinit();
  return true;
}

static cc_config_configuration_set_return_value
cc_configuration_set(uint16_t parameter_number,  cc_config_parameter_value_t* new_value, cc_config_parameter_size_t size)
{
  cc_config_configuration_set_return_value return_value = CC_CONFIG_RETURN_CODE_OK;
  bool io_transaction_result = false;
  bool is_value_in_range = false;
  bool has_to_break = false;
  cc_config_parameter_buffer_t parameter_buffer;

    bool override_read_only_check = false;
    if((parameter_number == SERIAL_NUMBER_1_PAR || 
        parameter_number == SERIAL_NUMBER_2_PAR || 
        parameter_number == SERIAL_NUMBER_3_PAR) && 
        false == IsSerialLockFlagActive())
    {
      if (false == cc_configuration_write_serial((parameter_number-SERIAL_NUMBER_1_PAR), new_value->as_uint32))
      {
        return CC_CONFIG_RETURN_CODE_IO_FAIL;
      }
      override_read_only_check = true;
    }
    
    for(uint16_t parameter_ix = 0 ; parameter_ix < configuration_pool->numberOfParameters ; parameter_ix++)
    {
      if( (configuration_pool->parameters[parameter_ix].attributes.flags.read_only == false || true == override_read_only_check)
          && configuration_pool->parameters[parameter_ix].number == parameter_number) 
      {
        if(configuration_pool->parameters[parameter_ix].attributes.size != size)
        {
          return_value = CC_CONFIG_RETURN_CODE_NOT_SUPPORTED;
          has_to_break = true;
        }
        if(true == has_to_break)
        {
          break;
        }
        io_transaction_result = cc_configuration_io_read( configuration_pool->parameters[parameter_ix].file_id,
                                                            (uint8_t*)&parameter_buffer.data_buffer,
                                                            sizeof(cc_config_parameter_value_t));

