GOAP-Dev01/_example-sdk_2024123-ZGM230SA_/_EXAMPLE-SDK_2024123-ZGM230SA_/src/DevCommandClasses/Configuration/src/CC_Configuration.c
        if(io_transaction_result == false)
        {
          return_value = CC_CONFIG_RETURN_CODE_IO_FAIL;
        }

        parameter_buffer.metadata = &configuration_pool->parameters[parameter_ix];
        is_value_in_range = cc_configuration_limit_value(&parameter_buffer, new_value);
        if( true == is_value_in_range)
        {
            memcpy( (void*)(uint8_t*)&parameter_buffer.data_buffer.as_uint8_array,
                  (const void*)new_value->as_uint8_array,
                  sizeof(cc_config_parameter_value_t));

            io_transaction_result = cc_configuration_io_write( configuration_pool->parameters[parameter_ix].file_id,
                                                            (const uint8_t*)&parameter_buffer.data_buffer,
                                                            sizeof(cc_config_parameter_value_t));
        } else {
          return_value = CC_CONFIG_RETURN_CODE_NOT_SUPPORTED;
        }
        if(io_transaction_result == false)
        {
          return_value = CC_CONFIG_RETURN_CODE_IO_FAIL;
        }
        has_to_break = true;
      }

    }

    return return_value;
}

bool
cc_configuration_get(uint16_t parameter_number, cc_config_parameter_buffer_t* parameter_buffer)
{
  bool io_transaction_result = false;

  if(parameter_buffer != NULL)
  {
     for(uint16_t parameter_ix = 0 ; parameter_ix < configuration_pool->numberOfParameters ; parameter_ix++)
     {
       if(configuration_pool->parameters[parameter_ix].number == parameter_number)
       {
         parameter_buffer->metadata = &configuration_pool->parameters[parameter_ix];
         io_transaction_result = cc_configuration_io_read( configuration_pool->parameters[parameter_ix].file_id,
                                                             (uint8_t*)&parameter_buffer->data_buffer,
                                                             sizeof(cc_config_parameter_value_t));
         break;
       }
     }
  }
  if (false == io_transaction_result)
  {
    cc_configuration_get_first_parameter(parameter_buffer);
  }
  return io_transaction_result;
}

static bool
cc_configuration_probe(cc_config_parameter_buffer_t* parameter_buffer)
{
  static cc_config_parameter_metadata_t zero_meta;
  static uint16_t lowest_parameter_number;

  lowest_parameter_number = cc_configuration_get_lowest_parameter_number();
  zero_meta.next_number = lowest_parameter_number;
  memset(parameter_buffer, 0, sizeof(cc_config_parameter_buffer_t));
  parameter_buffer->metadata = &zero_meta;
  return true;
}

static bool
cc_configuration_reset_to_default_value(uint16_t parameter_number)
{
  bool io_transaction_result = false;

  for(uint16_t parameter_ix = 0 ; parameter_ix < configuration_pool->numberOfParameters ; parameter_ix++)
  {
    if(configuration_pool->parameters[parameter_ix].number == parameter_number)
    {
      io_transaction_result = cc_configuration_io_write( configuration_pool->parameters[parameter_ix].file_id,
                                                          (const uint8_t*)&configuration_pool->parameters[parameter_ix].attributes.default_value,
                                                           sizeof(cc_config_parameter_value_t));

      break;
    }
  }

  return io_transaction_result;
}

static bool
cc_configuration_get_first_parameter(cc_config_parameter_buffer_t* parameter_buffer)
{
  uint16_t lowest_parameter_number = cc_configuration_get_lowest_parameter_number();
  return cc_configuration_get(lowest_parameter_number, parameter_buffer);
}

static uint16_t
cc_configuration_get_lowest_parameter_number(void)
{
  uint16_t lowest_parameter_number = 0xFFFF;

  /*Find the lowest number to be the first one*/
  for(uint16_t parameter_ix = 0 ; parameter_ix < configuration_pool->numberOfParameters ; parameter_ix++)
  {
    uint16_t current_parameter_number = configuration_pool->parameters[parameter_ix].number;
    if(lowest_parameter_number > current_parameter_number)
    {
      lowest_parameter_number = current_parameter_number;
    }
  }
  return lowest_parameter_number;
}

static uint8_t
cc_configuration_calc_reports_to_follow(size_t data_length, size_t payload_limit)
{
  uint16_t reports_to_follow_count  = (uint16_t)(data_length / payload_limit);
  uint16_t val = ((data_length % payload_limit) != 0)?1:0;
  reports_to_follow_count += val; /*Round up*/
  reports_to_follow_count-=1; /*If the data fits in payload it should be zero*/

  return (uint8_t)reports_to_follow_count;
}

static size_t
cc_configuration_strnlen(const char *str, size_t maxlen)
{
  size_t i = 0;
  if(str != NULL)
  {
    for(i = 0; i < maxlen && str[i]; i++);
  }
  return i;
}

static bool
cc_configuration_is_valid_size(cc_config_parameter_size_t size_value)
{
  //Reffering to SDS13781-15 document, table-32 (page 165)
  bool return_value = false;
  switch(size_value)
  {
    case CC_CONFIG_PARAMETER_SIZE_8_BIT:
      return_value = true;
    break;

    case CC_CONFIG_PARAMETER_SIZE_16_BIT:
      return_value = true;
    break;

    case CC_CONFIG_PARAMETER_SIZE_32_BIT:
      return_value = true;
    break;

    case CC_CONFIG_PARAMETER_SIZE_NOT_SPECIFIED:
      return_value = false;
    break;

    default:
      return_value = false;
    break;
  }
  return return_value;

}

REGISTER_CC_V4(COMMAND_CLASS_CONFIGURATION_V4, CONFIGURATION_VERSION_V4, CC_Configuration_handler, NULL, NULL, NULL, 0, init_and_reset, init_and_reset);
